app/views/pictures/show.html.haml

<br>
- if @picture.comments.all.any?
---
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = $1  [["picture_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."picture_id" = $1  [["picture_id", 3]]