app/controllers/comments_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def new
    @picture = Picture.find(params[:picture_id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("comments", "created_at", "updated_at", "picture_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comments", "Omg! I love!"], ["created_at", 2016-08-29 18:50:37 UTC], ["updated_at", 2016-08-29 18:50:37 UTC], ["picture_id", 3]]
---
  def create
    @picture = Picture.find(params[:picture_id])
    @picture.comments.create(review_params)