app/controllers/pictures_controller.rb

  def create
    @picture = Picture.create(picture_params)
---
INSERT INTO "pictures" ("caption", "created_at", "updated_at", "location") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "Go!"], ["created_at", 2016-08-29 16:59:50 UTC], ["updated_at", 2016-08-29 16:59:50 UTC], ["location", "London"]]

  def show
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def edit
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @picture = Picture.find(params[:id])
    @picture.update(picture_params)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "pictures" SET "caption" = $1, "location" = $2, "updated_at" = $3 WHERE "pictures"."id" = $4  [["caption", "Life is a beach and I'm just playing in the sand"], ["location", ""], ["updated_at", 2016-08-29 17:24:04 UTC], ["id", 108]]

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 5]]